import numpy as np
import matplotlib.pyplot as plt
import random


N=1000 # розмір вибірки
X = [] # Пустий масив для наповнення

# Цикл зі 1000 ітерацій, на кожній з яких додаємо 1 випадковий  
# елемент з нормальним розподілом, із середнім 10 та стандартним відхиленням 5.
for i in range(N):
    X.append(random.expovariate(1/20))

# формується 2 масива: n - кільксть елементів, що попали в інтервал, x - масив границь інтервалів
print(np.histogram(X, bins=10))
n,x=np.histogram(X, bins=10) 

# масив початків інтервалів (прибрали останнє, найбільше значення)
xmin=x[:-1] 

# ширина інтервалу (різниця двох послідовних стовпчиків).
dx=x[1]-x[0] 

# емпірична приведена частота: частка від кількості елментів в інтервалі та загальної кількості елементів.
y=n/N 

# масив центрів інтервалів
xmid=xmin+dx/2 
# виводимо емпіричну гістограму приведених частот
plt.bar(xmid, y, width=dx, color='y')

# Виводимо підписи на осях
plt.xlabel('x')
plt.ylabel('Частота (ймоврінсть)')

# Малюємо сітку та гістораму.
plt.grid()
plt.show()
