import numpy as np
import matplotlib.pyplot as plt
import random
from scipy import stats

N=100 # розмір вибірки
# X = [11.3, 13.5, 9.76, 11.51, 11.1, 6.16, 5.83, 9.3, 12.99, 8.76, 9.17, 8.34, 15.23, 11.51, 10.76, 3.22, 8.86, 14.16, 7.27, 10.74, 9.8, 10.21, 8.7, 14.73, 10.78, 6.53, 9.03, 15.85, 6.55, 10.13, 9.07, 13.63, 10.92, 7.88, 4.85, 7.78, 10.95, 4.26, 9.59, 9.21, 8.96, 8.22, 13.36, 11.49, 11.43, 12.25, 16.3, 7.63, 10.45, 10.21, 6.1, 11.14, 10.94, 11.47, 12.06, 9.22, 11.36, 13.54, 9.54, 12.35, 14.11, 8.47, 15.37, 7.59, 4.25, 13.53, 9.2, 7.65, 3.37, 12.02, 12.37, 8.06, 8.06, 11.42, 7.36, 13.19, 13.09, 12.24, 3.78, 8.36, 16.37, 4.97, 10.46, 5.68, 8.98, 12.58, 6.0, 12.13, 10.83, 8.96, 12.02, 5.74,
# 12.7, 9.98, 12.44, 5.62, 11.06, 11.73, 10.69, 12.16]

X = [11.3, 13.5, 9.76, 11.51, 11.1, 11.16, 12.83, 9.3, 12.99, 8.76, 9.17, 8.34, 15.23, 11.51, 10.76, 3.22, 8.86, 14.16, 7.27, 10.74, 9.8, 10.21, 8.7, 11.73, 10.78, 6.53, 9.03, 15.85, 6.55, 10.13, 9.07, 13.63, 10.92, 7.88, 4.85, 7.78, 10.95, 4.26, 9.59, 9.21, 8.96, 8.22, 13.36, 11.49, 11.43, 12.25, 16.3, 7.63, 10.45, 10.21, 6.1, 11.14, 10.94, 11.47, 12.06, 9.22, 11.36, 13.54, 9.54, 12.35, 14.11, 8.47, 15.37, 7.59, 4.25, 13.53, 9.2, 7.65, 3.37, 12.02, 12.37, 8.06, 8.06, 11.42, 7.36, 13.19, 13.09, 12.24, 10.78, 8.36, 12.37, 4.97, 10.46, 5.68, 8.98, 12.58, 11.0, 12.13, 10.83, 8.96, 12.02, 5.74,
12.7, 9.98, 12.44, 12.62, 11.06, 11.73, 10.69, 12.16]

# Цикл зі 1000 ітерацій, на кожній з яких додаємо 1 випадковий  
# елемент з нормальним розподілом, із середнім 10 та стандартним відхиленням 5.


mean,std = stats.norm.fit(X)


k2,pvalue = stats.normaltest(X) # тест на нормальний розподіл (k2 - сума квадратів коефіцієнтів асиметрії і ексцесу)
print (f"Перевірка на відповідність нормальному розподілу: {k2},pvalue = {pvalue}>0.05") # наприклад, якщо pvalue < 0.05, то це не нормальний розподіл

# формується 2 масива: n - кільксть елементів, що попали в інтервал, x - масив границь інтервалів
print(np.histogram(X, bins=10))
n,x=np.histogram(X, bins=10) 

# масив початків інтервалів (прибрали останнє, найбільше значення)
xmin=x[:-1] 

# ширина інтервалу (різниця двох послідовних стовпчиків).
dx=x[1]-x[0] 

# емпірична приведена частота: частка від кількості елментів в інтервалі та загальної кількості елементів.
y=n/N 

# масив центрів інтервалів
xmid=xmin+dx/2 
# виводимо емпіричну гістограму приведених частот
plt.bar(xmid, y, width=dx, color='y')

el_min = min(X)
el_max = max(X)
X1=np.linspace(el_min,el_max,1000) # аргументи для побудови теоретичної кривої
dist2 = stats.norm(loc=mean, scale=std) # нормальний розподіл із параметрами після підгонки
plt.plot(X1, dist2.pdf(X1),'k-') # нарисувати теоретичну криву густини імовірності

# Виводимо підписи на осях
plt.xlabel('x')
plt.ylabel('Частота (ймоврінсть)')

# Малюємо сітку та гістораму.
plt.grid()
plt.show()
